let types = {
	// 四段
	"v4k": ["か", "き", "く", "く", "け", "け"],
	"v4h": ["は", "ひ", "ふ", "ふ", "へ", "へ"],
	"v4m": ["ま", "み", "む", "む", "め", "め"],
	"v4r": ["ら", "り", "る", "る", "れ", "れ"],
	// 上二段
	"v2t-k": ["ち", "ち", "つ", "つる", "つれ", "ちよ"],
	"v2b-k": ["び", "び", "ぶ", "ぶる", "ぶれ", "びよ"],
	// 下二段
	"v2a-s": ["え", "え", "う", "うる", "うれ", "えよ"],
	"v2d-s": ["で", "で", "づ", "づる", "づれ", "でよ"],
	"v2m-s": ["め", "め", "む", "むる", "むれ", "めよ"],
	"v2r-s": ["れ", "れ", "る", "るる", "るれ", "れよ"],
	"v2y-s": ["え", "え", "ゆ", "ゆる", "ゆれ", "えよ"],
	// その他
	"v1-k": ["", "", "る", "る", "れ", "よ"],
	"v1-s": ["", "", "る", "る", "れ", "よ"],
	"vk": ["こ", "き", "く", "くる", "くれ", "こ"],
	"vs": ["せ", "し", "す", "する", "すれ", "せよ"],
	"vz": ["ぜ", "じ", "ず", "ずる", "ずれ", "ぜよ"],
	"vn": ["な", "に", "ぬ", "ぬる", "ぬれ", "ね"],
	"vr": ["ら", "り", "り", "る", "れ", "れ"]
}

// Maps all the types above to one of the nine main conjugation patterns
let jodoushiTypeMap = {
	// 四段
	"v4k": "v4",
	"v4h": "v4",
	"v4m": "v4",
	"v4r": "v4",
	// 上二段
	"v2t-k": "v2-k",
	"v2b-k": "v2-k",
	// 下二段
	"v2a-s": "v2-s",
	"v2d-s": "v2-s",
	"v2m-s": "v2-s",
	"v2r-s": "v2-s",
	"v2y-s": "v2-s",
	// その他
	"v1-k": "v1-k",
	"v1-s": "v1-s",
	"vk": "vk",
	"vs": "vs",
	"vz": "vs",
	"vn": "vn",
	"vr": "vr"
}